//Напишите многопоточный ограниченный буфер с использованием ReentrantLock
public class Main {
    public static void main(String[] args) {
        System.out.println();
    }
}